Sub-IoT/Sub-IoT-Stack/stack/framework/hal/chips/ezr32lg/emlib/inc/em_ldma.h
/**
 * @brief
 *   DMA descriptor initializer for byte transfers from memory to a peripheral
 * @param[in] src       Source data address.
 * @param[in] dest      Peripheral data register destination address.
 * @param[in] count     Number of bytes to transfer.
 */
#define LDMA_DESCRIPTOR_SINGLE_M2P_BYTE( src, dest, count ) \
{                                                           \
  .xfer =                                                   \
  {                                                         \
    .structType   = ldmaCtrlStructTypeXfer,                 \
    .structReq    = 0,                                      \
    .xferCnt      = ( count ) - 1,                          \
    .byteSwap     = 0,                                      \
    .blockSize    = ldmaCtrlBlockSizeUnit1,                 \
    .doneIfs      = 1,                                      \
    .reqMode      = ldmaCtrlReqModeBlock,                   \
    .decLoopCnt   = 0,                                      \
    .ignoreSrec   = 0,                                      \
    .srcInc       = ldmaCtrlSrcIncOne,                      \
    .size         = ldmaCtrlSizeByte,                       \
    .dstInc       = ldmaCtrlDstIncNone,                     \
    .srcAddrMode  = ldmaCtrlSrcAddrModeAbs,                 \
    .dstAddrMode  = ldmaCtrlDstAddrModeAbs,                 \
    .srcAddr      = (uint32_t)(src),                        \
    .dstAddr      = (uint32_t)(dest),                       \
    .linkMode     = 0,                                      \
    .link         = 0,                                      \
    .linkAddr     = 0                                       \
  }                                                         \
}

/**
 * @brief
 *   DMA descriptor initializer for byte transfers from a peripheral to memory.
 * @param[in] src       Peripheral data source register address.
 * @param[in] dest      Destination data address.
 * @param[in] count     Number of bytes to transfer.
 * @param[in] linkjmp   Address of descriptor to link to expressed as a
 *                      signed number of descriptors from "here".
 *                      1=one descriptor forward in memory,
 *                      0=one this descriptor,
 *                      -1=one descriptor back in memory.
 */
#define LDMA_DESCRIPTOR_LINKREL_P2M_BYTE( src, dest, count, linkjmp ) \
{                                                                     \
  .xfer =                                                             \
  {                                                                   \
    .structType   = ldmaCtrlStructTypeXfer,                           \
    .structReq    = 0,                                                \
    .xferCnt      = ( count ) - 1,                                    \
    .byteSwap     = 0,                                                \
    .blockSize    = ldmaCtrlBlockSizeUnit1,                           \
    .doneIfs      = 1,                                                \
    .reqMode      = ldmaCtrlReqModeBlock,                             \
    .decLoopCnt   = 0,                                                \
    .ignoreSrec   = 0,                                                \
    .srcInc       = ldmaCtrlSrcIncNone,                               \
    .size         = ldmaCtrlSizeByte,                                 \
    .dstInc       = ldmaCtrlDstIncOne,                                \
    .srcAddrMode  = ldmaCtrlSrcAddrModeAbs,                           \
    .dstAddrMode  = ldmaCtrlDstAddrModeAbs,                           \
    .srcAddr      = (uint32_t)(src),                                  \
    .dstAddr      = (uint32_t)(dest),                                 \
    .linkMode     = ldmaLinkModeRel,                                  \
    .link         = 1,                                                \
    .linkAddr     = ( linkjmp ) * 4                                   \
  }                                                                   \
}

/**
 * @brief
 *   DMA descriptor initializer for byte transfers from memory to a peripheral
 * @param[in] src       Source data address.
 * @param[in] dest      Peripheral data register destination address.
 * @param[in] count     Number of bytes to transfer.
 * @param[in] linkjmp   Address of descriptor to link to expressed as a
 *                      signed number of descriptors from "here".
 *                      1=one descriptor forward in memory,
 *                      0=one this descriptor,
 *                      -1=one descriptor back in memory.
 */
#define LDMA_DESCRIPTOR_LINKREL_M2P_BYTE( src, dest, count, linkjmp ) \
{                                                                     \
  .xfer =                                                             \
  {                                                                   \
    .structType   = ldmaCtrlStructTypeXfer,                           \
    .structReq    = 0,                                                \
    .xferCnt      = ( count ) - 1,                                    \
    .byteSwap     = 0,                                                \
    .blockSize    = ldmaCtrlBlockSizeUnit1,                           \
    .doneIfs      = 1,                                                \
    .reqMode      = ldmaCtrlReqModeBlock,                             \
    .decLoopCnt   = 0,                                                \
    .ignoreSrec   = 0,                                                \
    .srcInc       = ldmaCtrlSrcIncOne,                                \
    .size         = ldmaCtrlSizeByte,                                 \
    .dstInc       = ldmaCtrlDstIncNone,                               \
    .srcAddrMode  = ldmaCtrlSrcAddrModeAbs,                           \
    .dstAddrMode  = ldmaCtrlDstAddrModeAbs,                           \
    .srcAddr      = (uint32_t)(src),                                  \
    .dstAddr      = (uint32_t)(dest),                                 \
    .linkMode     = ldmaLinkModeRel,                                  \
    .link         = 1,                                                \
    .linkAddr     = ( linkjmp ) * 4                                   \
  }                                                                   \
}

/**
 * @brief
 *   DMA descriptor initializer for Immediate WRITE transfer
 * @param[in] value     Immediate value to write.
 * @param[in] address   Write sddress.
 */
#define LDMA_DESCRIPTOR_SINGLE_WRITE( value, address )  \
{                                                       \
  .wri =                                                \
  {                                                     \
    .structType   = ldmaCtrlStructTypeWrite,            \
    .structReq    = 1,                                  \
    .xferCnt      = 0,                                  \
    .byteSwap     = 0,                                  \
    .blockSize    = 0,                                  \
    .doneIfs      = 1,                                  \
    .reqMode      = 0,                                  \
    .decLoopCnt   = 0,                                  \
    .ignoreSrec   = 0,                                  \
    .srcInc       = 0,                                  \
    .size         = 0,                                  \
    .dstInc       = 0,                                  \
    .srcAddrMode  = 0,                                  \
    .dstAddrMode  = 0,                                  \
    .immVal       = (value),                            \
    .dstAddr      = (uint32_t)(address),                \
    .linkMode     = 0,                                  \
    .link         = 0,                                  \
    .linkAddr     = 0                                   \
  }                                                     \
}

/**
 * @brief
 *   DMA descriptor initializer for Immediate WRITE transfer
 *
 *   The link address must be an absolute address.
 * @note
 *   The linkAddr member of the transfer descriptor is not
 *   initialized.
 * @param[in] value     Immediate value to write.
 * @param[in] address   Write sddress.
 */
#define LDMA_DESCRIPTOR_LINKABS_WRITE( value, address )  \
{                                                        \
  .wri =                                                 \
  {                                                      \
    .structType   = ldmaCtrlStructTypeWrite,             \
    .structReq    = 1,                                   \
    .xferCnt      = 0,                                   \
    .byteSwap     = 0,                                   \
    .blockSize    = 0,                                   \
    .doneIfs      = 0,                                   \
    .reqMode      = 0,                                   \
    .decLoopCnt   = 0,                                   \
    .ignoreSrec   = 0,                                   \
    .srcInc       = 0,                                   \
    .size         = 0,                                   \
    .dstInc       = 0,                                   \
    .srcAddrMode  = 0,                                   \
    .dstAddrMode  = 0,                                   \
    .immVal       = (value),                             \
    .dstAddr      = (uint32_t)(address),                 \
    .linkMode     = ldmaLinkModeAbs,                     \
    .link         = 1,                                   \
    .linkAddr     = 0   /* Must be set runtime ! */      \
  }                                                      \
}

/**
 * @brief
 *   DMA descriptor initializer for Immediate WRITE transfer
 * @param[in] value     Immediate value to write.
 * @param[in] address   Write sddress.
 * @param[in] linkjmp   Address of descriptor to link to expressed as a
 *                      signed number of descriptors from "here".
 *                      1=one descriptor forward in memory,
 *                      0=one this descriptor,
 *                      -1=one descriptor back in memory.
 */
#define LDMA_DESCRIPTOR_LINKREL_WRITE( value, address, linkjmp )  \
{                                                                 \
  .wri =                                                          \
  {                                                               \
    .structType   = ldmaCtrlStructTypeWrite,                      \
    .structReq    = 1,                                            \
    .xferCnt      = 0,                                            \
    .byteSwap     = 0,                                            \
    .blockSize    = 0,                                            \
    .doneIfs      = 0,                                            \
    .reqMode      = 0,                                            \
    .decLoopCnt   = 0,                                            \
    .ignoreSrec   = 0,                                            \
    .srcInc       = 0,                                            \
    .size         = 0,                                            \
    .dstInc       = 0,                                            \
    .srcAddrMode  = 0,                                            \
    .dstAddrMode  = 0,                                            \
    .immVal       = (value),                                      \
    .dstAddr      = (uint32_t)(address),                          \
    .linkMode     = ldmaLinkModeRel,                              \
    .link         = 1,                                            \
    .linkAddr     = ( linkjmp ) * 4                               \
  }                                                               \
}

/**
 * @brief
 *   DMA descriptor initializer for SYNC transfer
 * @param[in] set          Sync pattern bits to set.
 * @param[in] clr          Sync pattern bits to clear.
 * @param[in] matchValue   Sync pattern to match.
 * @param[in] matchEnable  Sync pattern bits to enable for match.
 */
#define LDMA_DESCRIPTOR_SINGLE_SYNC( set, clr, matchValue, matchEnable )  \
{                                                                         \
  .sync =                                                                 \
  {                                                                       \
    .structType   = ldmaCtrlStructTypeSync,                               \
    .structReq    = 1,                                                    \
    .xferCnt      = 0,                                                    \
    .byteSwap     = 0,                                                    \
    .blockSize    = 0,                                                    \
    .doneIfs      = 1,                                                    \
    .reqMode      = 0,                                                    \
    .decLoopCnt   = 0,                                                    \
    .ignoreSrec   = 0,                                                    \
    .srcInc       = 0,                                                    \
    .size         = 0,                                                    \
    .dstInc       = 0,                                                    \
    .srcAddrMode  = 0,                                                    \
    .dstAddrMode  = 0,                                                    \
    .syncSet      = (set),                                                \
    .syncClr      = (clr),                                                \
    .matchVal     = (matchValue),                                         \
    .matchEn      = (matchEnable),                                        \
    .linkMode     = 0,                                                    \
    .link         = 0,                                                    \
    .linkAddr     = 0                                                     \
  }                                                                       \
}

/**
 * @brief
 *   DMA descriptor initializer for SYNC transfer
 *
 *   The link address must be an absolute address.
 * @note
 *   The linkAddr member of the transfer descriptor is not
 *   initialized.
 * @param[in] set          Sync pattern bits to set.
 * @param[in] clr          Sync pattern bits to clear.
 * @param[in] matchValue   Sync pattern to match.
 * @param[in] matchEnable  Sync pattern bits to enable for match.
 */
#define LDMA_DESCRIPTOR_LINKABS_SYNC( set, clr, matchValue, matchEnable ) \
{                                                                         \
  .sync =                                                                 \
  {                                                                       \
    .structType   = ldmaCtrlStructTypeSync,                               \
    .structReq    = 1,                                                    \
    .xferCnt      = 0,                                                    \
    .byteSwap     = 0,                                                    \
    .blockSize    = 0,                                                    \
    .doneIfs      = 0,                                                    \
    .reqMode      = 0,                                                    \
    .decLoopCnt   = 0,                                                    \
    .ignoreSrec   = 0,                                                    \
    .srcInc       = 0,                                                    \
    .size         = 0,                                                    \
    .dstInc       = 0,                                                    \
    .srcAddrMode  = 0,                                                    \
    .dstAddrMode  = 0,                                                    \
    .syncSet      = (set),                                                \
    .syncClr      = (clr),                                                \
    .matchVal     = (matchValue),                                         \
    .matchEn      = (matchEnable),                                        \
    .linkMode     = ldmaLinkModeAbs,                                      \
    .link         = 1,                                                    \
    .linkAddr     = 0   /* Must be set runtime ! */                       \
  }                                                                       \
}

/**
 * @brief
 *   DMA descriptor initializer for SYNC transfer
 * @param[in] set          Sync pattern bits to set.
 * @param[in] clr          Sync pattern bits to clear.
 * @param[in] matchValue   Sync pattern to match.
 * @param[in] matchEnable  Sync pattern bits to enable for match.
 * @param[in] linkjmp   Address of descriptor to link to expressed as a
 *                      signed number of descriptors from "here".
 *                      1=one descriptor forward in memory,
 *                      0=one this descriptor,
 *                      -1=one descriptor back in memory.
 */
#define LDMA_DESCRIPTOR_LINKREL_SYNC( set, clr, matchValue, matchEnable, linkjmp ) \
{                                                                         \
  .sync =                                                                 \
  {                                                                       \
    .structType   = ldmaCtrlStructTypeSync,                               \
    .structReq    = 1,                                                    \
    .xferCnt      = 0,                                                    \
    .byteSwap     = 0,                                                    \
    .blockSize    = 0,                                                    \
    .doneIfs      = 0,                                                    \
    .reqMode      = 0,                                                    \
    .decLoopCnt   = 0,                                                    \
    .ignoreSrec   = 0,                                                    \
    .srcInc       = 0,                                                    \
    .size         = 0,                                                    \
    .dstInc       = 0,                                                    \
    .srcAddrMode  = 0,                                                    \
    .dstAddrMode  = 0,                                                    \
    .syncSet      = (set),                                                \
    .syncClr      = (clr),                                                \
    .matchVal     = (matchValue),                                         \
    .matchEn      = (matchEnable),                                        \
    .linkMode     = ldmaLinkModeRel,                                      \
    .link         = 1,                                                    \
    .linkAddr     = ( linkjmp ) * 4                                       \
  }                                                                       \
}

